[
  {
    "info": "Source: https://husnyjeffrey.com/singapore-cost-of-living-2025-a-guide-for-singles-and-those-living-alone/\n\nSINGAPORE COST OF LIVING 2025: A GUIDE FOR SINGLES\n\nThis data is based on a survey of nearly 150 people living in Singapore.\n\nKEY TAKEAWAY:\n- Employment Pass (EP) holders living alone spend around SGD $2,660 per month.\n- S Pass holders living alone spend about SGD $1,603 per month.\n\nBREAKDOWN OF AVERAGE MONTHLY EXPENSES:\n\n1. FOR EMPLOYMENT PASS (EP) HOLDERS:\n- Rental: SGD $1,490\n- Utilities (electricity, water, internet): SGD $52\n- Groceries: SGD $234\n- Dining Out (at restaurants or hawker centres): SGD $438\n- Public Transport (buses and MRT): SGD $81\n- Taxi/Cabs (e.g., Grab): SGD $70\n- Personal Care (haircuts, spa): SGD $44\n- Shopping (clothing, footwear): SGD $116\n- Subscriptions (Netflix, Spotify): SGD $20\n- Entertainment (movies, social outings): SGD $86\n- Mobile Bill: SGD $29\n- TOTAL BASIC COST: SGD $2,660 per month\n\nAdditional costs some people have:\n- Gym Fee: SGD $77 (but 73% of people do not pay for a gym)\n- Insurance: SGD $144 (but 68% of people do not pay for insurance)\n- TOTAL WITH EXTRAS: SGD $2,881 per month\n\n2. FOR S PASS HOLDERS:\n- Rental: SGD $864\n- Utilities (electricity, water, internet): SGD $25\n- Groceries: SGD $169\n- Dining Out (at restaurants or hawker centres): SGD $204\n- Public Transport (buses and MRT): SGD $81\n- Taxi/Cabs (e.g., Grab): SGD $50\n- Personal Care (haircuts, spa): SGD $39\n- Shopping (clothing, footwear): SGD $86\n- Subscriptions (Netflix, Spotify): SGD $10\n- Entertainment (movies, social outings): SGD $47\n- Mobile Bill: SGD $28\n- TOTAL BASIC COST: SGD $1,603 per month\n\nAdditional costs some people have:\n- Gym Fee: SGD $70 (but 73% of people do not pay for a gym)\n- Insurance: SGD $139 (but 73% of people do not pay for insurance)\n- TOTAL WITH EXTRAS: SGD $1,812 per month\n\nIMPORTANT CONTEXT FOR MIGRANT WORKERS:\nThe salaries for Foreign Domestic Workers (FDW) and some other migrant workers are lower than these cost of living figures. \nThis is because the employer provides accommodation and food, which are the two biggest expenses shown above (rental and dining out/groceries). \nA migrant worker's salary is meant for personal use and to send money home to their family, not to cover the full cost of living like a local or an EP holder."
  },
  {
    "info": "Who is covered\nThe hours of work guidelines apply only to those covered under Part 4 of the Employment Act.\nNote: Part 4 of the Employment Act does not cover managers and executives.\nIf you are not covered under Part 4 of the Employment Act, your terms and conditions of employment will be according to your employment contract.\nDefinitions\nWeek – A continuous period of 7 days starting from Monday and ending on Sunday.\nHours of work – The period during which employees are expected to carry out the duties assigned by their employers. It does not include any intervals allowed for rest and meals.\nEmployers are not required to pay for rest and meal hours.\nBreak times\nYou are generally not required to work more than 6 consecutive hours without a break.\nHowever, if the nature of the work requires continuous work for up to 8 hours, breaks must be provided for meals. The breaks should be at least 45 minutes long.\nNormal hours of work\nContractual working hours are the hours that you and your employer have agreed to in the contract of service.\nFor common work arrangements, your contractual hours of work are as follows:\n|\nIf you work\n|\nYour contractual hours of work are\n|\n|\n5 days or less a week\n|\nUp to 9 hours per day or 44 hours a week\n|\n|\nMore than 5 days a week\n|\nUp to 8 hours a day or 44 hours a week\n|\nFor other work arrangements, your contractual hours of work are as follows:\n|\nIf you work\n|\nYour contractual hours of work are\n|\n|\nLess than 44 hours every alternate week\n|\nUp to 48 hours a week, but capped at 88 hours in any continuous 2-week period.\nExample:\nIf week 1 = 40 hours; week 2 = 48 hours; week 3 = 40 hours:\n- Average for weeks 1 and 2 = 44 hours\n- Average for weeks 2 and 3 = 44 hours\n|\n| Shifts of up to 12 hours a day |\nUp to an average of 44 hours over a continuous 3-week period.\nExample:\nIf week 1 = 40 hours; week 2 = 44 hours; week 3 = 48 hours; week 4 = 40 hours:\n- Average for weeks 1, 2 and 3 = 44 hours\n- Average for weeks 2, 3 and 4 = 44 hours\n|\nNote: If you are not a shift worker but agree to work up to 12 hours a day, and not exceeding an average of 44 hours over any 3 continuous weeks, you must:\n- Give your consent in writing.\n- Have the provisions of Sections 38 and 40 of the Employment Act explained to you.\n- Be informed of your daily working hours, number of working days in each week and weekly rest day.\nOvertime pay\nOvertime work is all work in excess of the normal hours of work (excluding breaks).\nYou can claim overtime if you are:\n- A non-workman earning a monthly basic salary of $2,600 or less.\n- A workman earning a monthly basic salary of $4,500 or less.\nThe overtime rate payable for non-workmen is capped at the salary level of $2,600, or an hourly rate of $13.60.\nFor overtime work, your employer must pay you at least 1.5 times the hourly basic rate of pay. Payment must be made within 14 days after the last day of the salary period.\nA non-workman earns $2,600 a month and works 2 hours of overtime. The overtime pay is:\n$13.60 × 1.5 × 2 hours = $40.80\nCalculate your overtime pay\nCalculate your overtime pay\nHow overtime pay is calculated\nOvertime pay is calculated as follows:\n- Hourly basic rate of pay × 1.5 × number of hours worked overtime\nThe hourly basic rate of pay is calculated as follows:\n|\nFor this category of employee\n|\nHourly basic rate of pay is\n|\n|\nMonthly-rated employee\n|\n(12 x Monthly basic rate of pay) / (52 x 44)\n|\n|\nDaily-rated employee\n|\nDaily pay at the basic rate / Working hours per day\n|\n|\nPiece-rated employee\n|\nTotal weekly pay at the basic rate of pay / Total number of hours worked in the week\n|\nMaximum hours of work\nAs an employee, you are not allowed to work more than 12 hours a day.\nHowever, your employer can ask you to work more than 12 hours a day in the following circumstances:\n- An accident or threat of accident.\n- Work that is essential to the life of the community, national defence or security.\n- Urgent work to be done to machinery or plant.\n- An interruption of work that was impossible to foresee.\nWorking more than 12 hours a day (overtime exemption)\nIf an employer requires employees to work more than 12 hours a day (up to a maximum of 14 hours), they must apply for an overtime exemption.\nMaximum hours of overtime\nAn employee can only work up to 72 overtime hours in a month.\nEmployers can apply for an exemption if they require employees to work more than the 72 hours of overtime in a month.\nNote: these work activities will not be granted exemption.\nWork on rest day or public holidays is not counted in the 72-hour overtime limit, except for work done beyond the usual daily working hours on those days. Such extra hours are included in the 72-hour limit.\nOvertime on a rest day or public holiday is calculated as follows:\n- (Hourly basic rate of pay × 1.5 × Number of hours worked overtime) + (Rest day or public holiday pay)\nRest day\nYour employer must provide 1 rest day per week.\nA rest day comprises 1 whole day (midnight to midnight). It is not a paid day.\nFor shift workers, the rest day can be a continuous period of 30 hours. A 30-hour rest period that starts before 6pm on a Sunday is considered as 1 rest day within the week, even if it extends into the Monday of the following week.\nA week is continuous period of 7 days starting from Monday and ending on Sunday.\nYour employer cannot compel you to work on a rest day, unless under exceptional circumstances.\nWhen rest day can fall\nThe employer determines the rest day, which can be on a Sunday, or any other day of the week.\nOther than the rest day, the other days of the week which you don’t need to work are not considered rest days.\nIf the rest day is not a Sunday, your employer should prepare a monthly roster and inform you of the rest days before the start of each month.\nThe maximum interval allowed between 2 rest days is 12 days.\nCalculate your pay for work on a rest day\nCalculate your pay for work on a rest day\nHow pay for work on a rest day is calculated\nPayment for work on a rest day is calculated as follows:\n| If work is done |\nFor up to half your normal daily working hours |\nFor more than half your normal daily working hours |\nBeyond your normal daily working hours |\n| At the employer’s request |\n1 day’s salary |\n2 days’ salary |\n2 days’ salary + overtime pay |\n| At the employee’s request |\nHalf day’s salary |\n1 day’s salary |\n1 day’s salary + overtime pay |"
  },
  {
    "info": "IMPORTANT DISCLAIMER: \nThis information is from an official MOM guide published in May 2011. While the core principles and laws (like employer obligations, safety rules, and general rights) remain valid, specific figures (like agency fee caps and salary thresholds) may have changed.\nAlways cross-check the latest official information on the MOM website: www.mom.gov.sg \n\nThe following is a summary of the 2011 guide:\n1. Core Requirement: Work Permit\n* All foreign workers must have a valid Work Permit.\n* The permit is tied to a specific employer and specific occupation. Working for anyone else or in any other job is illegal.\n* Workers must carry their original Work Permit card at all times.\n* Violating Work Permit conditions can lead to cancellation and a ban from future employment in Singapore.\n\n2. Key Work Permit Conditions\n* Marriage & Pregnancy: Strictly prohibited to marry a Singapore Citizen/Permanent Resident or to become pregnant/deliver a child in Singapore without prior approval from the Controller of Work Permits. This rule applies even after the permit expires or is cancelled.\n* Residence: Must live only at the address provided by the employer. Any change must be reported to the employer.\n* Medical Examination: Must undergo and pass a medical exam by a Singapore-registered doctor.\n\n3. Employer Obligations\n* Employers are legally bound to provide:\n    * Safe working conditions.\n    * Acceptable accommodation.\n    * upkeep and maintenance, including medical treatment.\n* Employers are prohibited from:\n    * Demanding or receiving any payment from the worker for employment.\n    * Recovering any employment-related expenses from the worker.\n\n4. Agency Fee Regulations\n* Fee Cap: Workers should not pay more than the equivalent of one month's salary per year of the work permit/contract (whichever is shorter) to the Singapore employment agency.\n    * The total fee is capped at a maximum of two months' salary, even for contracts longer than two years.\n    * This cap includes any fees transferred from a home country agent to the Singapore agency.\n* Receipts: Singapore agencies must provide receipts for any fees paid.\n* Refund: If employment is terminated by the employer within the first 6 months, the agency must refund at least 50% of the fee.\n\n5. Employment Rights & Benefits\nWorkers are protected under Singapore's Employment Act. Key entitlements include:\n* Rest Day: One unpaid rest day per week. If worked, must be paid 2 days' salary.\n* Public Holidays: Entitled to paid public holidays. If worked, must be paid 2 days' salary.\n* Annual Leave: 7 days after 12 months of service, increasing to a max of 14 days.\n* Sick Leave: Entitled to paid outpatient and hospitalization leave after 3 months of service, with days phasing in up to 14/60 days after 6 months. Requires a medical certificate and notifying the employer within 48 hours.\n\n6. Workplace Safety\n* Workers must follow safety rules, use provided safety equipment (PPE), and not take shortcuts.\n* Specific hazards highlighted: Falls from height, falling objects, slips/trips, electrocution, fire/explosions, confined spaces, and vehicle movements.\n* Work Injury: Must report any injury to a supervisor. MOM assists with injury compensation claims.\n\n7. Singapore Laws & Penalties\nSingapore laws apply equally to foreigners. Severe penalties exist for:\n* Overstaying: Jail, fine, and caning (if over 90 days).\n* Theft / Robbery: Long jail terms and caning.\n* Fighting / Causing Hurt: Jail, fines, caning for grievous hurt.\n* Drug Trafficking: Mandatory Death Penalty.\n* Other offences: Fines or jail for littering, public urination, jaywalking, public drunkenness, making false police reports.\n\n8. Local Practices & Etiquette\n* Be considerate to neighbours (no noise, no blocking corridors).\n* Maintain high standards of communal and personal hygiene.\n* Behave appropriately in public (no fighting, no sleeping in public areas, dress appropriately).\n* Follow road safety rules (use crossings, don't cycle against traffic).\n\n9. How to Get Help - Key Contacts\n* Ministry of Manpower (MOM): General Enquiries: 6438 5122\n* MOM Address: 18 Havelock Road Singapore 059764\n* Police / Ambulance: 999 / 995\n* MOM Safety Hotline (Report unsafe practices): 6317 1111\n* Foreign Manpower Management Division (For illegal deployment, agency fee issues, poor living conditions): 120 Kim Seng Road Singapore 239436.\n* Migrant Workers' Centre (MWC): 6536 2692\n* HOME Helpline (Female Workers): 6341 5525\n* HOME Helpline (Male Workers): 6341 5535\n* Samaritans of Singapore (SOS - Crisis Support): 1800-2214 444"
  },
  {
    "info": "SAFETY AND HEALTH GUIDE FOR MIGRANT WORKERS\nSource: Singapore Ministry of Manpower (MOM) - https://www.mom.gov.sg\n\n\nROAD SAFETY:\nSafe Cycling\nIf you ride a bicycle, cycle safely.\n• Always cycle on bicycle paths and look out for other cyclists or pedestrians.\n• Be mindful of pedestrians and slow down. Ring your bicycle bell from a distance to alert pedestrians, especially on shared pavements.\n• Follow the traffic rules and keep close to the side of the road. Do not cycle in the middle of the road or against oncoming traffic.\n• When cycling, park your bicycle in the allocated parking areas. Do not leave your bicycle in the middle of the road or pavement, as it will obstruct drivers and pedestrians.\n\nIt is important to stay safe when on the road.\n• Follow traffic rules. Do not jaywalk. Always cross the road at traffic lights.\n• Cross the road when the traffic light is green.\n• Use a pedestrian crossing, overhead bridge or underpass to get safely to the other side of the road.\n• If driving, give way to pedestrians and slow down when approaching road openings, junctions or pedestrian crossings.\n\nGENERAL WORK SAFETY:\nIf you work in Construction, you must complete the Construction Safety Orientation Course. While at work, you must follow what you had learnt during the course and the safety instructions given by your employer or supervisor.\n• Always wear the correct Personal Protective Equipment (PPE) (e.g. helmet, safety goggles, hearing protectors, gloves and safety boots) for the work you are doing, and keep the PPE in good working condition.\n• Wear your safety harness and secure it to a stable anchor point.\n• Do not take risks or shortcuts or ignore safety rules.\n\nWORKING AT HEIGHTS\n• Use proper platforms when carrying out work at heights.\n• Always maintain three-point contact when using ladders.\n\nBEWARE OF FALLING OBJECTS\n• Stay clear of suspended loads.\n• Do not place or store equipment and materials near openings.\n• Wear your safety helmet and steel-capped boots.\n\nFALL PREVENTION\n• Keep the workplace dry, clean and free from spills and tripping objects such as wires.\n• Hold onto handrails when using the stairs.\n• Wear anti-slip safety boots.\n\nELECTRICAL HAZARDS\n• Do not use faulty electrical equipment or faulty power sockets.\n• Keep the work area clean and dry.\n• Carry out electrical work only in dry conditions.\n• Wear rubber gloves and boots.\n• When using extension cords and electrical appliances, use only those with the ‘safety mark’.\n\nCONFINED SPACES\n• Always conduct a gas check before entering a confined space.\n• Put on protective equipment (e.g. respirator, full body harness and retrieval line) before entering a confined space.\n\nFIRE HAZARDS\n• Look out for flammable materials such as solvents, pressurised tanks and sawdust before carrying out hot works.\n• Keep flammable materials in closed containers and store them in well-ventilated areas.\n\nDRIVING AT WORK\n• Watch out for vehicles and keep to walkways when walking around the workplace.\n• Avoid driving if you are taking medicine that causes drowsiness.\n• Take short breaks to stretch and rest if you are driving for long hours.\n• Check blind spots before reversing.\n• Place traffic cones around your work area to keep vehicles away.\n\nSEEKING MEDICAL TREATMENT\nInform your employer when you are sick and that you need to see a doctor.\nYou can see a doctor at:\n1. MOM approved Medical Centres nearest to your place of work or stay\n2. MOM designated General Practitioner (GP) Clinics\n3. Telemedicine doctor (online consult only) via FWMOMCare app\nYour employer must allow you to see a doctor and he is responsible for paying your medical bills. \nPlease remember to obtain a medical certificate and a receipt for payment from the medical clinic to give to your employer. \nYou should take a photo of the medical certificate and receipt for your own records.\n\nINJURY FROM WORK\nYour employer is responsible for the safety, health and well-being of all his employees.\n\nWhat to do if you are injured at work?\n1. Report your injury to your supervisor/employer and seek treatment quickly. \nIf you receive any hospitalisation leave/medical leave or light duty from the doctor/dentist, inform your supervisor/ employer to submit an incident report to MOM.\n2. If your employer does not submit an incident report when you are injured at work, please inform MOM. \nYou can inform MOM by calling 64385122, or coming down to MOM Services Centre (1500 Bendemeer Road, Singapore 339946) to speak to an MOM officer. \nYou only need to give MOM your contact details, the name of your employer and the date of the accident. \nMOM can assist you even if you are unable to speak English.\n3. Keep records of your correspondence (e.g. your WhatsApp and SMS, messages, etc.) with your supervisor/employer on the work accident details.\n4. Ask a friend to take photos of the place that you were injured, and the tools or machinery that caused your injury. Show the photos to the doctor.\n5. If you are scheduled for a medical appointment, please attend the appointment and do not instead go to other doctors.\nThe treating doctor is in the best position to assess your injury and aid your recovery. \nFailure to attend scheduled medical appointments will result in the suspension of your work injury compensation claim.\n6. Keep a copy of the documents relevant to your injuries (e.g. medical certificates, medical bills) and hand the originals to your employer.\n7. The insurer or MOM will calculate the compensation amount and issue a notice to you and your employer.\nIf there is no objection to the amount, your employer/insurer must pay you within 21 days of the notice service date.\nYour employer will handle your compensation claim and will notify MOM.\n\nMEDICAL INSURANCE REQUIREMENTS FOR MIGRANT WORKERS\nKEY RULE: Employers are legally required to buy and maintain medical insurance for all migrant workers. The cost of this insurance cannot be passed on to the worker.\n\nCOVERAGE REQUIREMENTS:\n- The insurance must cover inpatient care and day surgery for both work-related and non-work-related conditions.\n- The minimum coverage is SGD $60,000 per year, per worker.\n\nENHANCED MI RULES (From 1 July 2023):\n- For claims above SGD $15,000, the insurer pays 75% and the employer pays 25% (co-payment).\n- The annual claim limit is at least SGD $60,000.\n\nCO-PAYMENT RULES (For workers, excluding FDWs):\n- An employer can only ask a worker to share medical costs (co-pay) if ALL of these conditions are met:\n  1. The co-pay amount is reasonable and does NOT exceed 10% of the worker’s monthly salary.\n  2. The co-payment duration does NOT exceed 6 months for every 2 years of employment.\n  3. The co-payment option is explicitly written in the employment contract and the worker has given full consent.\n\nRULES SPECIFICALLY FOR FOREIGN DOMESTIC WORKERS (FDWs):\n- Employers are NOT allowed to have any co-pay arrangement with a Foreign Domestic Worker (FDW). The employer must pay 100% of the medical insurance cost.\n\nSUBMISSION REQUIREMENTS:\n- Employers must submit the insurance details online to MOM before a Work Permit can be issued or renewed.\n- The following details must be kept updated in the WP Online system:\n  * Name of the insurance company\n  * Insurance policy number\n  * Policy start date\n  * Policy expiry date\n\nACTION STEPS FOR WORKERS:\n- You should not be paying for your own medical insurance. This is your employer's responsibility.\n- If your employer asks you to pay for medical insurance or medical bills, this is likely illegal.\n- If your employer tries to include a co-payment clause in your contract for medical bills, you should question it and seek advice.\n- For help, contact MOM at 6438 5122 or an NGO like HOME."
  }
]